app/views/home/index.html.erb

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = ?  [[nil, 1]]
---

  <% current_user.lists.each do |list| %>