app/controllers/items_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "items" ("body", "created_at", "list_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", ""], ["created_at", Mon, 30 Dec 2013 02:08:39 UTC +00:00], ["list_id", 2], ["title", "porsche"], ["updated_at", Mon, 30 Dec 2013 02:08:39 UTC +00:00]]
---
def create
  @list = List.find(params[:list_id])
  @item = @list.items.create(params[:item].permit(:title, :body))

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "11"]]
SELECT "items".* FROM "items" WHERE "items"."list_id" = ? AND "items"."id" = ? LIMIT 1  [["list_id", 11], ["id", "2"]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 2]]
---
def destroy
  @list = List.find(params[:list_id])
  @item = @list.items.find(params[:id])
  @item.destroy