app/controllers/lists_controller.rb

INSERT INTO "lists" ("created_at", "description", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 30 Dec 2013 10:00:01 UTC +00:00], ["description", "skjhskjh"], ["title", "jjjjhhggf"], ["updated_at", Mon, 30 Dec 2013 10:00:01 UTC +00:00], ["user_id", 1]]
---
  def create
   @list = List.new(params[:list].permit(:title, :description, :user_id))
   @list.user_id = current_user.id
    if @list.save

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? ORDER BY "lists"."id" ASC LIMIT 1  [["id", 2]]
---
  def show
    @list = List.find(params[:id])

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "6"]]
---
  def update
    @list = List.find(params[:id])